cmsis-svd/cmsis-svd/data/Atmel/ATSAMD21E16L.svd
        <register>
          <name>INPUTCTRL</name>
          <description>Input Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Positive Mux Input Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>MUXPOSSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>ADC AIN0 Pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>ADC AIN1 Pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>ADC AIN2 Pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>ADC AIN3 Pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN4</name>
                  <description>ADC AIN4 Pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>ADC AIN5 Pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN6</name>
                  <description>ADC AIN6 Pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN7</name>
                  <description>ADC AIN7 Pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN8</name>
                  <description>ADC AIN8 Pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN9</name>
                  <description>ADC AIN9 Pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN10</name>
                  <description>ADC AIN10 Pin</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN11</name>
                  <description>ADC AIN11 Pin</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN12</name>
                  <description>ADC AIN12 Pin</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN13</name>
                  <description>ADC AIN13 Pin</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN14</name>
                  <description>ADC AIN14 Pin</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN15</name>
                  <description>ADC AIN15 Pin</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN16</name>
                  <description>ADC AIN16 Pin</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN17</name>
                  <description>ADC AIN17 Pin</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN18</name>
                  <description>ADC AIN18 Pin</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN19</name>
                  <description>ADC AIN19 Pin</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>Temperature Reference</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Bandgap Voltage</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDCOREVCC</name>
                  <description>1/4  Scaled Core Supply</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDIOVCC</name>
                  <description>1/4  Scaled I/O Supply</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC Output</description>
                  <value>0x1c</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Mux Input Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>MUXNEGSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>ADC AIN0 Pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>ADC AIN1 Pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>ADC AIN2 Pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>ADC AIN3 Pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN4</name>
                  <description>ADC AIN4 Pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>ADC AIN5 Pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN6</name>
                  <description>ADC AIN6 Pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN7</name>
                  <description>ADC AIN7 Pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Internal Ground</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOGND</name>
                  <description>I/O Ground</description>
                  <value>0x19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUTSCAN</name>
              <description>Number of Input Channels Included in Scan</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INPUTOFFSET</name>
              <description>Positive Mux Setting Offset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain Factor Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>GAINSelect</name>
                <enumeratedValue>
                  <name>1X</name>
                  <description>1x</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2x</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4x</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8x</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16x</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>1/2x</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STARTEI</name>
              <description>Start Conversion Event In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCEI</name>
              <description>Synchronization Event In</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESRDYEO</name>
              <description>Result Ready Event Out</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMONEO</name>
              <description>Window Monitor Event Out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result Conversion Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Monitor Lower Threshold</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Lower Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINUT</name>
          <description>Window Monitor Upper Threshold</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINUT</name>
              <description>Window Upper Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINCORR</name>
          <description>Gain Correction</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETCORR</name>
          <description>Offset Correction</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>Calibration</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LINEARITY_CAL</name>
              <description>Linearity Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BIAS_CAL</name>
              <description>Bias Calibration Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
